{
    "Ethinyl_estradiol": {
        "topic_number_-1": {
            "count": 200,
            "name": "-1_Nuvaring experiences and side effects - weight changes, mood swings, convenience in use",
            "tweet": {
                "tweet_0": "I just recently started Nuvaring about 2 months ago and before that, I was on the pill for about 4 or 5 years. I do LOVE not having to think about taking a pill everyday. I haven&#039;t really noticed any change in my sex drive. BUT I have gained a little weight.. not much, but I think that&#039;s because I lost weight when I started the pills. The biggest issue I have with this is that it&#039;s inconvenient when it comes to sex. The first time, I left it in, but it fell out somewhere in between and I COMPLETELY lost it, haha. My partner said he could never feel it, but it actually gave me some discomfort.  Since then, I have had it fall out once more, but I felt it when it did. ",
                "tweet_1": "First birth control I&#039;ve ever been on and I have had little to no side effects with the only tangible ones being weight loss ( lost 5lbs ) &amp; some mood swings or nausea during my first week of inserting Nuvaring and the night after I take it out. These symptoms are super manageable and don&#039;t affect my daily life what so ever! \r\n\r\nI&#039;ve been on Nuvaring for about 5 months now using it as the only method of birth control and it has amazing results! I don&#039;t feel it when it&#039;s in place and my boyfriend hasn&#039;t felt it during sex either. I love that I get my period monthly since it lets me know for sure that my birth control is doing it&#039;s job and I&#039;m not pregnant! \r\n\r\nI don&#039;t see myself switching brands for a long time.",
                "tweet_2": "I was on the pill for about 2 years and it became so hard keeping track if I had taken it or not. I had always heard great things about the Nuvaring do I decided to try it. My favorite thing is knowing that its just there and I don&#039;t have to take it everyday. On the other hand I have broken out what feels like everywhere, I&#039;ve never had a problem with acne before. Also the day after I put it in I started getting really bad headaches and I felt upset. I thought I was just stressed so I kept the ring in. It continued to get worse and it got to the point that if someone even walked by me I would get angry. Yes birth control is different for everyone but I took it out two days ago and I already feel so much better!"
            }
        },
        "topic_number_0": {
            "count": 132,
            "name": "0_Mixed Experiences with Nuvaring as Birth Control",
            "tweet": {
                "tweet_0": "Nuvaring is the best birth control ever. For me it was about not having any side affects, and nuvaring did just that. I&#039;ve been on it for a year as a form of birth control. It has worked  great not only as birth control but also made my periods shorter that only last 4 days, are very light, and always on time. NO other side affects. I&#039;ve always followed the directions. You can leave it in during sex and I always do since my boyfriend has never mentioned it being uncomfortable. You can take it out for up to 3 hours a day without risk of pregnancy but personally I never take it out. You can also use it while using tampons as well which is nice for when you first start using. Overall I would definitely recommend it to anyone.",
                "tweet_1": "I&#039;ve been on the NuvaRing for a little over a year and at first I loved it, it was my first birth control and I did not think I would remember to take a pill everyday so this seemed perfect and it was. It is very effective for not getting pregnant, I have been having unprotected sex with my boyfriend since and not once had an issue.  The only thing is that it did not help with my cramps and back pain, as the months go on, the pain gets worse and worse.  I also have times of severe mood swings and depression.  I&#039;m switching to Seasonale this month to see if it works any better.",
                "tweet_2": "I have now been on NuvaRing for 2 years and I like it.  I was never one to forget to take my pill but it is nice to not worry about it.  I went on NuvaRing because it was recommended by a friend and the doctor.  I have read many of the poor reviews on the NuvaRing and all the bad reviews are common side effects of birth control in general.  I have been on birth control for about 13 years and have used different types all have the same side effects; mood swings, bloating, cramping, weight gain, lack of sex drive and poor natural lubrication during sex.  I have been happy with the NuvaRing and will continue to use it."
            }
        },
        "topic_number_1": {
            "count": 78,
            "name": "1_Positive Experiences with NuvaRing as Birth Control",
            "tweet": {
                "tweet_0": "I have been on the NuvaRing for almost 6 years, I decided to try it due to the fact that I had a hard time remembering to take the pill every day. I absolutely love the ring and have recommended it to most of my friends. What first was initially hard for me was remembering what day and how many weeks it was in, I found an app for my phone which helped tremendously. The pros are definitely that you don&#039;t have to take it every day and it&#039;s comfortable, I sometimes forget that it is there. Cons would have to be the decrease in sex drive but a little exercise helps with that. I&#039;ve had no pregnancy scares or break through bleeding. All in all the ring beats the pill and the Depo shot.",
                "tweet_1": "I&#039;ve been on the Nuva ring now for two years. I personally love it ! It&#039;s so much easier to use than having to take a pill everyday. I used to have a 7 day period and now it&#039;s 3 full days and 2 spotting days. I used to get horrible side effects from the pill but the only negative side effect from the Nuva ring is that about 2 weeks out of the month I don&#039;t have really any sex drive but I&#039;ll take that over acting like a lunatic and not even getting to have sex cause I scared my partner off haha. Hope this helps !",
                "tweet_2": "23 years old, petite body size. i&#039;ve been using the nuva ring for a little over a month now and so far i really like it. prior to using the nuva ring i was taking birth control pills. not having to remember to take a pill everyday is such a relief! the first time i got my period using the nuva ring it normal. slight cramping but nothing out of the ordinary. my boob size has increased probably a half cup so far. the only down side is that my partner can feel the nuva ring when we have intercourse. intercourse can be uncomfortable for him if the ring is in, so we have to take it out. removing and inserting the nuva ring is very simple. i would recommend this birth control."
            }
        },
        "topic_number_2": {
            "count": 77,
            "name": "2_Birth Control Experiences and Side Effects",
            "tweet": {
                "tweet_0": "This is the first form of hormonal birth control I have been on. I&#039;m 27. I love it. I have had no negative side effects at all. I normally have bad PMS and mood swings and bad cramping.  My doctor has me using it in a way I only get a period every 3 months.  It has normalized my mood which is the main thing I was hoping for besides not getting pregnant. I have to switch though because there is no generic and my insurance only covers $10 of it. So it&#039;s expensive for me.",
                "tweet_1": "Great birth control that was easy convenient. All I did was just put it in for three weeks, forget about it, and then take it out after the three weeks is up. Sometimes I would have to take it out during sex, although other than that I did not experience any discomfort or it slipping out. This birth control did not make me gain any weight except for my boobs. I did experience vaginal dryness and extreme decrease in my sex drive, which really made sex unpleasurable at times. This birth control made me extremely tired all the time. I would just sleep for hours on and had little to no energy. I am currently off this bc due to that side effect. Caused me to have cystic acne after 5 months.",
                "tweet_2": "I have only been on this birth control for a little over 2 weeks now. I have not been on birth control for over 3 years and had a baby almost a year ago. I quit breastfeeding and decided to go on birth control until me and my husband wanted to try for another. I put it in on the first day of my period like the pamphlet and my gyn told me and I have been bleeding for 2 weeks! I originally got online to see if other women had this happen and even called my gyno to make sure everything was ok. Apparently it is just breakthrough bleeding eventhough you would think that would only be during the middle of the month not for 2 weeks straight! There are no cramps and its very little but extremely annoying. I do like that I can take it out during sex."
            }
        },
        "topic_number_3": {
            "count": 46,
            "name": "3_NuvaRing experiences and side effects",
            "tweet": {
                "tweet_0": "The NuvaRing at first was odd for me bc iIwas scared it was going to fall out, but if it is pushed inside it should stay in place and still work. I&#039;m very active and I&#039;ve had no problems with this. At first I did have some light bleeding and more recently I&#039;ve have light brown discharge, but I&#039;ve read that this is completely normal and that the nuvaring is still working. I have experienced some bloating and headaches easily but it&#039;s usually around a certain time of the month. my sex drive seems fine, it might have gone away for a few weeks but that could have also been due to stress. (FYI my doctor told me to keep it in for 4 weeks, bc I am using it for birth control and not to regulate my periods)",
                "tweet_1": "I have not been on Nuvaring for very long and I do love it. I have some side effects but I can live with. I have been on it for about 2 months. I love that as soon as I put it in all bleeding stops within just hours. The 1st month I had no issues at all I just kept checking that it was still there because I couldn&#039;t feel anything and didn&#039;t want to get pregnant. But this second month I have had a small yeast infection and been pretty dry down there and my sex drive is not what it was but not gone. Only real issue is my husband feels it so now when it comes to &quot;fun&quot; it has to come out before and back in after and that I can do. Other then those few things so far I LOVE IT!",
                "tweet_2": "I have been very pleased with the NuvaRing. I have been on it for 3 months now. I have had no real bad side effects. When I first started it I did have some discharge that was more than normal but that stopped pretty much after the first week or 2. I noticed that I do retain water but that is to be expected. I have had no real mood swings as opposed to the pill. I was a little nervous to get on NuvaRing because it stays in the vagina for 3 weeks and I had read about vaginal infections but so far I am happy with it! I am not currently sexually active (I am getting married in August and wanted to try birth control methods) So I don&#039;t know if my husband will feel it but I love it!"
            }
        },
        "topic_number_4": {
            "count": 45,
            "name": "4_NuvaRing - Positive Experiences and Recommendations",
            "tweet": {
                "tweet_0": "The ring is the best birth control I have used. I had the pills but it was so hard to remember to take and I had the Patch. I gained a lot of weight being on the Patch but when I was on the Ring, I was able to lose the weight and stay the same weight. It actually made my periods lighter and I barely have cramps. The only thing I have negative to say is I have constant discharge and it does not feel like a regular period. But I prefer the light bleeding then the harsh periods I use to have. I highly recommend but the Ring is not for everyone.",
                "tweet_1": "I&#039;ve been on the ring for several months. I really like it: it&#039;s easy to insert, it&#039;s simple to take out and it&#039;s very comfortable. My skin in very clear-it could be from the ring. Very happy with it. I&#039;ve had sex a few times with it inside. My partner is well endowed and didn&#039;t feel it at all. I don&#039;t plan on taking it out during sex. The only complaints I have is that it made me a little irritable at the beginning and the hormones have increased my appetite. Right now I am in the process of leaving it in continuously so that&#039;s I don&#039;t get anemia. I have awful PMDD and also have a tendency to become anemic. Can&#039;t wait to never get it again. I&#039;ve tried a bunch of birth control pills: horrible side effects. Love the ring!",
                "tweet_2": "I&#039;ve been on the ring for a few years and love it! After I put it in I can&#039;t feel it and forget about it. I have to write on the calendar when to take it in and out because I never think of it. My libido is very low but I&#039;m not sure if that&#039;s me or the ring. No other side effects for me. My insurance changed and I can&#039;t afford it now. So bummed to go back to the pill."
            }
        },
        "topic_number_5": {
            "count": 20,
            "name": "5_Nuva Ring experiences - convenience, menstrual changes, and impact on sex drive",
            "tweet": {
                "tweet_0": "I&#039;ve been on the Nuva ring for about 6 years now. Never had any problems from beginning to now. I did have horrible cramps my first month using it when my period came but after a few months my body got used to it.. I now only have a period that&#039;s about 3-5 days and I enjoy how it spots right before I take the ring out so I know it&#039;s time for my monthly cycle. It&#039;s easy to insert &amp; you don&#039;t have to think about having to take a pill everyday. I did notice thatwhen I had no health insurance, I went about a month without it; I had gotten my period &amp; it was horribly heavy &amp; terrible cramps. But after restarting everything got back to normal. I never noticed any weight gain or mood changes. My sex drive has stayed the same over all these years.",
                "tweet_1": "I was on the pill before Nuva Ring and the pill made me moody and cry a lot. I&#039;m definitely not one to be emotional. So I tried Nuva Ring now 8 months later I still love it. I really like that I can put it in and forget it for a month. I can skip periods if I want. Although I&#039;ve found I can 2 months without a period but then I have to do the period thing so I don&#039;t get breakthrough bleeding. I&#039;m also very much in control if I decided one day I didn&#039;t want it anymore I&#039;d just take it out. I haven&#039;t had any weight gain. When I do get my period it&#039;s short and light. The only con I had was I lost sex drive for about 5 months.  It&#039;s returned though so I&#039;m happy. Everyone is different but I&#039;d highly suggest giving Nuva Ring a try!",
                "tweet_2": "I have been using nuva ring for 6 months now after switching from the pill for 5 years. I have mixed emotions about nuva ring. I love the fact that it is very convenient and I never have to worry about taking a pill on time every day. I hardly have to thinkg about and most of the time I don&rsquo;t feel the ring at all, occasionally it slips down and I just have to push it back up- not a big deal. My periods actually seem heavier and last longer than what I experienced with the pill. I&rsquo;m hoping with continued use, they won&rsquo;t be as bad. Also, nuva ring is pretty expensive, I wish there was a generic version on the market. The biggest draw back for me is my diminished sex drive. My fianc&eacute; and I went from having sex at least 4-5 times a week to maybe once a week and that&rsquo;s because I force myself to. I&rsquo;m seriously considering switching back to the pill solely because of this. Other than the decreased sex drive, I haven&rsquo;t experienced any other side effects like weight gain or moodiness."
            }
        },
        "topic_number_6": {
            "count": 14,
            "name": "6_NuvaRing side effects and experiences",
            "tweet": {
                "tweet_0": "I have been using the Nuvaring for a few months now. In this time I lost my virginity and it was extremely painful and I had no sex drive. I figured the pain was just from the first time but the pain continued every time I had intercourse and I rarely even wanted to have sex; because it hurt and I had no sex drive. My boobs have grown a size and I have gained approximately 10 pounds. I thought there was something wrong with my body and the low sex drive was a symptom of depression. After reading the reviews I feel so relieved to know there&#039;s nothing wrong with me. I&#039;ve decided to switch birth controls, however other than those side effects, the nuvaring has kept me from getting pregnant and regulated my period",
                "tweet_1": "I was on Nuvaring for 10 years before I gave my body a hormone break. I&#039;ve been off of it for 4 months and will be going back on it next month because my fiance will be home from deployment and we are not ready for little ones yet. The first time around I loved not having to remember to take a pill everyday and I had no mood swings, and no lack of sex drive, there was only a few times where I could actually feel it during intercourse that was a bit uncomfortable. It is hard to say if I gained any weight because I was on it for so long but when I did go off of it I noticed I dropped a few pounds and had a little more energy. I am curious to see how this next month will pan out and will keep you informed.",
                "tweet_2": "Well, with what I have noticed with the Nuvaring is that I&#039;m having HORRIBLE mood swings. I&#039;ve been on birth control for years and I&#039;ve had to switch at least 4 times now. I&#039;m going to give this a try for the next month, but my relationship with my boyfriend of 3 years now is on the rocks because of my depression spells. I am tired and have no interest in anything it seems. I have taken this type before but it has been years and I don&#039;t remember my symptoms, I do enjoy not having to remember to take a small pill everyday, but I feel better when I&#039;m not on any type of birth control. So like others said - this could be just my reaction and what it does to me- who knows."
            }
        },
        "topic_number_7": {
            "count": 12,
            "name": "7_Nuvaring and its effects on acne, sex drive, and emotional stability",
            "tweet": {
                "tweet_0": "At first, I really liked Nuvaring. It&#039;s super easy to use and it&#039;s nice to be able to forget about it for 3 weeks. I could feel it every now and then but it wasn&#039;t uncomfortable, just there. After one month, I ended up with the worst acne on my back and chest that I have ever had in my life. The acne was so bad, I almost thought it was a reaction. I took Nuvaring out and within a week, my skin was clear again. I didn&#039;t have any other side effects besides the acne, but acne isn&#039;t something I can deal with. I&#039;m switching back to pills.",
                "tweet_1": "I&#039;ve been on Nuvaring for about 3 months. It is by the far my favorite form of birth control. I was on some form of the pill for the 5 years prior to this year and I had all sorts of problems with them. I love the convenience of Nuvaring and only having to remember it once a month. I was concerned about how Nuvaring would affect my tendency to acne and am pleasantly surprised that it is working the same as most pills and I have not had a problem with acne. There are a couple down sides to it though, no sex drive and tendency to gain weight. I am able to deal with the weight gain and adjust my lifestyle to where it is not a problem. However the decrease in sex drive is quite irritating for both my husband and myself.",
                "tweet_2": "No one is the same and NuvaRing obviously works for some but it did not for me. I&#039;m on my third month and just took it out for good. It put me in a permanent funk..and by that I mean constantly paranoid or sad and I would also be upset with my boyfriend over nothing. I hadn&#039;t been on BC at all for about 2 years before. Without birth control I do get PMS the week before my period which was toned down by the ring but it feels like it just spread it out to a more mild PMS the whole time (terrible!). My sex drive was noticeably diminished to the point where I didn&#039;t even want to have sex sometimes (and that NEVER happens lol). Overall, good for acne and regulating the period but not worth the emotional instability and sex drive effects."
            }
        },
        "topic_number_8": {
            "count": 11,
            "name": "8_Negative experiences with NuvaRing causing yeast infections and vaginal discomfort",
            "tweet": {
                "tweet_0": "I would NOT recommend this birth control for anyone! My first few days on it were okay, I did not feel any of the symptoms besides a little bit of heavier cramping and more abdominal pain while on my period. However, when my period was over and I tried having sex for the first time with my boyfriend, my vagina didn&#039;t stop burning afterward. It probably lasted all night. Since then, every time I have sex, it&#039;s fine during but afterward is really painful. It burns when I pee, my pH makes me feel gross and sometimes gives a smell, and this lasts for the rest of the day! Trying to have sex a second time is soooo painful, it even becomes so dry down there that it makes it worse. Do not use Nuva Ring!!",
                "tweet_1": "I&#039;ve been on NR for about three weeks and I just took it out. The very first side effect I noticed was acne. I&#039;ve never had acne before until I started this. My face was covered! I had brown discharge after the first week, which I know was normal, but I occasionally got this foul smell and more discharge. It hurt too much to have it in during intercourse and it bothered my boyfriend too, it never stayed in good, I could always feel it at the opening of my vagina, but what made me take it out is the itchiness and burning feeling I get from it!! I couldn&#039;t take it. Honestly I felt gross the whole time having something inside of me all the time.",
                "tweet_2": "So I was on the nuvaring for less than 1 week. I think it&#039;s been only 4 days, I just took it out for good. The first day everything was fine, the second day I experienced the worst itch in my vagina, I mean terrible. I&#039;ve never had a yeast infection, and this is my first time trying birth control. It also made my vagina extremely dry. Sex did not really hurt but was hardly enjoyable BC I was not wet at all, and he said he pushed it back up there for me during sex.. Don&#039;t recommend this method of birth control at all, and I&#039;m really not sure where to go from here, as I am very wary of all the hormonal side effects of all methods of birth control. I am very disappointed and do not want to ever experience this kind of discomfort again."
            }
        }
    }
}