{
    "Mirena": {
        "topic_number_-1": {
            "count": 531,
            "name": "-1_Mirena insertion experiences and benefits",
            "tweet": {
                "tweet_0": "I just had my second Mirena put in and still love it. I had the first one put in three months after my first child was born. I was a little scared after reading the negative reviews, but I had no side effects and no period after having it in for a couple of months. I had it removed two years later to get pregnant with my second and again no problems.  I was pregnant in three months.  There was a little cramping when it was put in and during that day.  I have recommended this form of birth control to all my friends.  So don&#039;t be scared!  As my doctor said people early post the positive but love to post the negative!",
                "tweet_1": "After reading mostly horrible reviews, I was pretty scared to get it put in. It was really the only option for me though, I have had very heavy periods since having my 2 kids. My Dr. recommended an ablation to control the bleeding, but when she sent me to an ob, she said Mirena could be something to think about. Hubby and I are done with kids, so this is only to control the bleeding. Anyways when I went in for the Mirena I barely felt a thing. A little bit of cramping that was it. Since then, I have had some spotting here and there. But no acne, weight gain, or moodiness. Sex drive is still great as ever. Nothing had changed for me. Everyone is different. You will only know how your body will react if you try it.",
                "tweet_2": "I am a 29 year old Mother of two beautiful boys. I am pretty sure I am not wanting to have any more children. Five years ago I decided to do the Mirena, the insertion process was a little painful, very little spotting the first couple of weeks, then no periods at all. I love the Mirena, I have had no more acne then I had before the Mirena, gained no weight, and only on occasion have slight bloating and cramps. Just yesterday since my Five years were up in May, I had my second Mirena put in. I love this product, I have had no problems with it, and I do recommend it to friends and family. It is nice to have peace of mind and not worry about remembering to take a pill. There is no other form of contraception I would use again."
            }
        },
        "topic_number_0": {
            "count": 136,
            "name": "0_Experiences with Mirena IUD",
            "tweet": {
                "tweet_0": "Had IUD PUT IN IN April and continued on pill with this for two months.  Started spotting during my last week of pills and then received the period from hell and it pretty much has NOT stopped!  I went on this for heavy bleeding and long periods and was told it would more than likely eliminate my period.....however, just the opposite!  We are in July amd I have had a period, light bleeding or spotting EVERY day?  Wish I had have just endured the heavy periods for 9 or so days as this is ridiculous.  Thought about  having it removed but read that some people bleed for months after removal.  STRONGLY RECOMMEND NOT USING Mirena IUD.",
                "tweet_1": "I have had the Mirena IUD for almost exactly 4 years. It was after having my only child. I did not want to get pregnant again at all. I had tried nuva ring and it made me bleed all the time. Could not remember to take a pill. And was too heavy for the patch (my old trusty) to be as effective. So I opted for the IUD. Insertion was just a pinch and the nurse held my hand and talked me through it. Mild cramps for about a day afterwards. I had very light spotting periods for a few months after I got it in. And then my periods quit all together. I have bled 2 times since and it was after sex. And only for a wipe or 2. Not even panty liner worthy. No periods at all ladies. Amazing. However I did experience hair thinning.",
                "tweet_2": "I have had the iud 2 times. The first time I had no problems very little cramping, very light to no bleeding. I went in 2012 after my son was born to get it again, and this time it was horrible. I had a lot more pain when inserted. I went back into for a checkup with my doctor to make sure it was in place, and he couldnt see it or feel the strings. So he told me that my body rejected it. So I thought he meant it fell out. I ended up going to the pill, and happen to be pregnant with my 3rd child. In 2015 I went to a chiropractor and had an xray done, and low and behold the iud was still in me. Looked like it was inside the uterus too. Now I am having to face the possibility of having surgery to get it out. My 3rd child was early and in nicu"
            }
        },
        "topic_number_1": {
            "count": 111,
            "name": "1_Experiences with Mirena for Birth Control",
            "tweet": {
                "tweet_0": "I had the Mirena for 6 years, I loved it. The pros for me were no period at all just a little spotting every now and then, I did not have any pain at all. The only thing I have to say negative about it was that I did gain some weight and I had a very hard time losing weight with it, but I was ok with it. I guess it did not have to worry about getting pregnant it did its job. I just removed it 2 days ago and am just letting my period start up again.",
                "tweet_1": "Hello everyone! I just want to share some experience with the use of Mirena. I have had it for almost 6 months. I was recommended by my healthcare provider of this option since it is safe and suit with my situation. I am 27 years old now and have no kids. In the process of putting it in, it was very painful since I have never had kids, so my cervix is not as wide as ones who did. I had bad cramps for about a week and period for almost a month. Since then, I have some spotting as well as cramps. The cramp is not as bad as I used to have when I was on period. I don&#039;t think I have other side effects such as acne or weight gain. I recommend it to you. To me, it is more of psychological fix! Worry free!",
                "tweet_2": "I&#039;m 24 years old and this is my second time to have the mirena. I had it the first time for 5 years then had it taken out due to the 5 year period and got put on the pill. The pill was not for me at all. So I decided to get the mirena again. I do not have a child. The mirena did hurt when I got it put in and did have bad cramping and some spotting but it was no unbearable. I was fine the next day. I have no gained weight being on the mirena or have had trouble with it. I still sometimes spot And my period is not regular anymore but that comes with it. I personally believe if you are not ready or do not want to have a child right now the mirena is the best thing!"
            }
        },
        "topic_number_2": {
            "count": 78,
            "name": "2_Positive experiences with Mirena insertion and benefits - minimal cramping, no periods, improved quality of life",
            "tweet": {
                "tweet_0": "I am on my 2nd Mirena. I am 36 yrs old, no kids and never want kids.  The insertion was very painful, but tolerable. I did tear up a little from the pain and I took deep breathes to help get thru it. I love the Mirena. I did not gain weight from it, however, I am a runner. No acne, no abdominal pain. I am spotting brown, but that&#039;s normal after insertion..for the 1st couple weeks. I did not get my period the first time around, so I am hoping the same this time. Not having a period for 5 years is amazing. This alone is worth the uncomfortable pain during insertion. Take 800mg of ibuprofen 1 hour before..it helps a little bit. But you still feel it...feels like the most painful cramping, you can ever imagine. Ugh. Ps. #never been in labor.",
                "tweet_1": "I am a little over two months now from insertion.  Never had children, 45 years old and insertion was almost unbearable for me.  However, after about 10-15 minutes after the insertion, I felt perfectly fine and went shopping!  I had almost no spotting the first month and then had a much lighter than normal period with almost no cramping.  I use to have very heavy periods with a lot of cramping.  The past month I have had no real period and no cramping, but I am spotting pretty much every day.  It does vary from bright red blood, to some days the brown blood.  Not really enjoying it, however I did read beforehand that this was pretty normal for the first few months.  Other than that, no side effects.  Still happy with my decision to do it.",
                "tweet_2": "I have only had it in for a couple weeks but so far I have loved it.  Insertion was not bad at all (I know this depends a lot on the person).  It just felt like very minor cramping for about a minute.  I got it in during my period, which is supposed to make it hurt less.  After insertion, there was mild to moderate cramping but went away with ibuprofen.  I have had occasional spotting.  Sex drive is the same.  I have noticed that I have to go to the bathroom significantly more often. But that&#039;s the only real complaint I have.  Was on the pill before and this is has been so much of a better experience. It was expensive but over the 5 years, it&#039;ll be worth it."
            }
        },
        "topic_number_3": {
            "count": 74,
            "name": "3_Mirena and Weight Gain Effects",
            "tweet": {
                "tweet_0": "I had the Mirena inserted at my 6-week postpartum check up in August 2014. The procedure was easy, no worse than any other OB/GYN experience. The first couple of months, my period was abnormal but eventually I had little to no periods at all (which is typical). The only negatives I have about Mirena is that it does hurt sometimes during sex if the intercourse gets a little intense. Also, I am completely convinced that it is the cause of my weight gain. I had lost all of my pregnancy weight and plus some before I had it put in. Since having Mirena, I have gained 40 pounds.",
                "tweet_1": "I am 21 years old and have a 3 year old daughter. I had Mirena placed a month postpartum. It was great at first. I had the dizziness and cramping after placement but a few hours and it was gone. I had my last period in December of 08, which has been great but the negative effects out number the 2 good effects. (No periods and no unwanted pregnancy) I have had Mirena for just over 3 years now and I feel like crap. I have bad mood swings, nausea, abdominal pains so severe sometimes I want to cry, headaches at least 3 times a week, weight gain, bloating (badly) and extreme tiredness. I didn&#039;t want to believe it is my Mirena because it works so well, but the worse my symptoms get, the more difficult it is not to blame Mirena. Getting it removed!",
                "tweet_2": "I am 24 years old and have a daughter who is almost 2. I got the Mirena put in when my daughter was 10 weeks old.  Since I got it put in I have had nothing but problems.  I have been having a lot of problems with my back, my mood swings and depression has taken a turn for the worst.  I have gained over 50lbs because since I got it put in I have done nothing but try to lose weight and nothing works and the change in my eating habits have changed since.  I some what lost my sex drive.  When it comes to that time of the month I get really bad cramps and bloating but no spotting. I haven&#039;t had a period in almost 8 months and it has been almost 2 years since I got it. I want it removed really bad."
            }
        },
        "topic_number_4": {
            "count": 61,
            "name": "4_Women's experiences with Mirena IUD insertion and usage",
            "tweet": {
                "tweet_0": "I had the Mirena put in about 6 weeks after I had my daughter. I had no problems with the procedure. I did however have some pretty heavy periods for a few months after. I kept it in for 5 years and about 7 months ago, I got my second Mirena placed in. Again, no issues with the procedure. I have not had any issues with it so far and I&#039;m in my 6th year of having the Mirena. I recommend it for sure!",
                "tweet_1": "I am 18 and have never gave birth and was previously on the pill. I got mirena almost a month ago. My gynecologist gave me misoprostol to take 3 hours before the procedure and 600 mg of ibuprofen. The insertion was extremely painful for me, but the procedure only took about 10 minutes. After the procedure I had some cramping and a brown discharge for the rest of the day. The next day I woke up and felt great. Ever since I have not had any problems except for some bleeding the first 2 weeks which is normal and easily controlled by using a light pad. The insertion was very painful, but SO worth not worrying and about getting pregnant and taking the pill perfectly. If you can take a day of pain I recommend this full heartily. Mirena is awesome",
                "tweet_2": "I have had my mirena for about a week and a half and I love it. Not having to rememeber the pill is 1000000% better.\r\r\nHowever, the insertion process was very painful. I have never had a child before which also makes its very uncomfortable. When she touched the back wall of my uterus it was literally one of the most uncomfortable painful cramps ever. It only took about 2 minutes though. After the procedure I had extreme and intense cramping for 5 hours after. the next 5 days I had on and of cramps that were uncomfortable but tolerable. I highly recommend the mirena iud because it is effective and a bit of pain for five years of protection is completely worth it. Don&#039;t let the pain keep your from getting this amazing form of birth control!"
            }
        },
        "topic_number_5": {
            "count": 41,
            "name": "5_Mirena insertion experiences and effects on bleeding, pain, and sex drive",
            "tweet": {
                "tweet_0": "In my experience, the Mirena was not for me. I was not able to lose weight, I gained weight, with only having it for 6 months. SEX was good, but not what it used to be. It felt like it was poking me. I was aware of the bleeding and how it will be, but it&#039;s been 6 months and I am bleeding every week for 4-5 days! Did not like this. I am getting this out. ",
                "tweet_1": "I am 20 years old and I had my Mirena inserted a month ago and to me personally the insertion was extremely painful. It was unlike any other painful cramp I have ever felt before, but the pain did not last for too long and after it was inserted I was fine and didn&#039;t really cramp much after. That being said, I have had no children and did not take my Advil as advised from the nurse prior to my appointment. Other than that I have only had light spotting and it has made my period lighter. Mirena is supposed to decrease your sex drive but honestly it has increased mine and my partner and I love it! I hope it stays this way and the bleeding/spotting stops soon!",
                "tweet_2": "I got the Mirena about three months ago, and it is absolutely wonderful! The insertion was painful, but completely tolerable. The day of insertion was spent in bed, but I was back to normal the next day. I hardly spot, the cramps come around during the time of the month, but they are not nearly as terrible as they were before Mirena. I was terrified of getting it after reading terrible reviews online, but I understood it works differently for everyone. My experience has been nothing but amazing, and my partner loves it! I don&#039;t have to worry about pills. Every once in while, I just have to make sure the strings are still there. At times, he can feel the strings but they do not poke or hurt him in any way."
            }
        },
        "topic_number_6": {
            "count": 41,
            "name": "6_Experiences with Mirena insertion and effects on periods, cramping, and spotting",
            "tweet": {
                "tweet_0": "I have had my mirena since Tuesday (4 days).  I have never had kids.  I was not on my cycle.  I have horrible periods so my doctor recommended this. In my mind I was thinking this is going to be horrible as I had other exams that had me in horrendous pain.  Insertion took about 2 minutes. Only pain I felt was when he was measuring the uterus.  Felt like cramps.  I  did not even feel it going in.  The Dr said ok that&#039;s it. I had no idea it was over.  Afterwards I went to lunch.  Little cramps after I got home,  through the night and the next day.  Just took tylenol.  Only spotted the day that I got it.  So far so good.",
                "tweet_1": "I got mirena put in two days ago and so far love it. I&#039;m twenty one with no kids and in a monogamous relationship. It does hurt to get in, a lot of cramping and pinching, but it only last for a few moments and is totally worth it in my book. I had it inserted towards the end of my period. Yesterday( the second day I had it) my bleeding stopped by the end of the day and I had no cramping. Today so far no spotting, although that wouldn&#039;t worry me, and ive also had no cramping or pain of any kind anywhere. So far I love it. My boyfriend and I had unprotected sex last night and it was wonderful not to have to think about taking  a pill or worrying if it was not effective yet. I would highly recommend so far. i will post again in about a month.",
                "tweet_2": "I have never had children, so my experience having Mirena inserted was VERY painful.  It hurt so bad that I felt sick and wanted to lay in bed and cry all day, but I did not have time to take off from work so I had to go back.  I was miserable.  I had cramps and spotting for two weeks afterwards.\r\r\n\r\r\nAfter that I was spotting every two weeks for almost a whole week.  After the first couple months I got back to having a period once a month and lots of spotting in between.  I also had severe cramps during my period and spotting.  I have had it in for going on six months, and the spotting and cramping has gotten much better.  My cramps are very minimal, much like they were before Mirena, and my period is very light with no spotting in between."
            }
        },
        "topic_number_7": {
            "count": 38,
            "name": "7_Mirena insertion and bleeding experience over months",
            "tweet": {
                "tweet_0": "I had Mirena inserted July 16, 15. I had very heavy bleeding for about 7 days after insertion. Insertion was not painful for me. Had heavy cramping the day of only. I have had some sort of bleeding ranging from a couple spots a day to very heavy for 2 months after. After my period last month I finally quit spotting all together then yesterday came along and I have a super heavy flow period out of the blue. Trying to make it to the 6 month mark but it is definitely annoying.",
                "tweet_1": "I had inserted Mirena almost 4 months ago. I experienced heavy bleeding about 2 weeks after I got it and everyday after that up until the 2nd month. It started off heavy and gradually lightened up but the heavy bleeding lasted almost a month and it was everyday. The doctor that inserted it said this was normal and the further from insertion date I got it would get better. I&#039;ve found this to be true. I am happy with Mirena.",
                "tweet_2": "I have had Mirena for about 9 months now. Before I was on the pill with a period for four days. I switched to Mirena because it was just easier than remembering to take a pill. Shortly after the insertion I had severe pain and bleeding. A month later I started spotting then bleeding for over a week. This would occur every couple of weeks. It was irritating but I thought it would have gotten better. Now 9 months later I experience periods for 2-3 weeks straight with constant bleeding. I am fine for a week, and the entire process begins. I am switching back to the pill."
            }
        },
        "topic_number_8": {
            "count": 22,
            "name": "8_Effects of Mirena IUD on Acne and Menstrual Bleeding",
            "tweet": {
                "tweet_0": "Had my Mirena fitted when I was 29 after my third child, and has been in place for threeish years. When it was fitted in 2009 my doctor fitted it, she was brilliant and quick and numbed the area with gel. Took pain killers before and after it was fitted and bled for a few days and took two months for my periods to stop and very light, now I get spotting every four, five months for a few days. Had no problems with it, no side effects although I have read bad reviews with abdominal and breast pain, depression, no sex drive acne all sorts. I already get acne but not got any worse, I have lost a stone. And am very happy with my Mirena and I forget I have half the time.",
                "tweet_1": "I had a Mirena put in when I had my laproscopy for Endometriosis about five months ago. I had a month of heavy bleeding at first now its just a few days a month of light bleeding the rest of the time there is a light discharge whatever that is. It is annoying as I have to always wear a pantyliner. Good thing the Mirena has gotten rid of the heavy painful bleeding I had and my menstrual migraines (which used to last for 7-10 days every month). Yay! Only thing that really upsets me is the acne on my chin, though its more like rash type spots then full on acne it looks dreadful as my face has red splotches on it and its embarrassing. Still I would prefer to have that then the horrible pains and migraines that I used to.",
                "tweet_2": "I had it inserted when I was 20, almost two years ago. I have no kids, pain from insertion was ok. It hurt for about a week. I rarely had cramps before I got it,  but since then I get pretty bad ones every few months. I broke out horribly from July-Dec, and it only got better because I took medication for my skin. The acne left dark purple marks on my cheeks, that are just barely disappearing. I gained about 10-15 lbs, but after about a year my body dropped back down to what I weighed before. It has prevented pregnancy, sex drive is about the same. After that year mark things were going great until about four months ago. Apparently my uterus lining has been getting worn down by the IUD. Bleeding for months straight. Every day."
            }
        },
        "topic_number_9": {
            "count": 20,
            "name": "9_experiences with Mirena birth control - acne, mood swings, weight issues, and sex drive impact",
            "tweet": {
                "tweet_0": "I am 22 years old, had been on birth control (Beyaz) for 5.5 years.  Had trouble with mood swings, weight gain, and bad acne through the pill... and continued to have heavy and irregular spotting between periods, with the pill.  My sister got Mirena and said it changed her life (for the better) So I then got the Mirena too. It was a very fast procedure, painful but nothing that you cannot handle by breathing through your nose, and out of your mouth.  It went smoothly and I was very crampy afterwards, but 2 hours later I was totally normal.  No spotting, or cramping since the input.  No period, my acne has cleared up, I&#039;ve got more energy throughout the day, and I&#039;m very pleased with it.",
                "tweet_1": "I had my first Mirena when I was 22, now I&#039;m 32 and working on getting my third one. I have never had children and I don&#039;t want to have any at all. Both insertions were very painful. The first time around, I was spotting and cramping for 4 months. I hated it to the point I wanted it removed, but decided to wait a little longer. I&#039;m glad I kept it! 4 months later, my periods are so light and almost nonexistent. Yes, my acne got worse, but it was because it got better when I was on the pill. I think my acne just went back to its pre-birth control levels. No mood swings, no more cramping, great birth control (10 years and not a single pregnancy or even a scare!) I recommend it, but I always say give it at least 4 months if you hate it.",
                "tweet_2": "I have been on the Mirena for 4 months and I have never been so disappointed.  I NEVER had acne in my life, maybe one pimple every couple months. Now my entire face is broken out, and even on a perfect skin regimen I am a pizza face. I have NEVER not had a sex drive. GONE! I love my boyfriend so much, but I have NO desire anymore and that is NOT like me at all.  \r\n\r\nThe few good things were...\r\nI didn&#039;t gain weight.\r\nI felt like myself.\r\nIt did its job (or so I would assume)   \r\n\r\nJust like with any birth control you have to try it yourself and see how it works for you."
            }
        },
        "topic_number_10": {
            "count": 18,
            "name": "10_Mirena IUD for Birth Control and Headache Relief",
            "tweet": {
                "tweet_0": "After having two children, I opted to have the Mirena inserted at my 6week PP visit, instead of using the pill. The insertion wasn&#039;t painful for me personally, however, I had it put in mid-end April, and it is now 4.5 months later and I have had bleeding/spotting everyday since that time. I have yet to have an actual period, but have spotted / bled enough every day since the insertion, with more painful cramps (daily) that I had previously on a regular. cycle. Also, I never experienced migraines in the past, and since the mirena I get them frequently (at least one biweekly) that brings nausea and effects my vision. I waited 5 months to give my body time to adjust, but at this point yes it&#039;s doing its job but the sideeffects are not worth it",
                "tweet_1": "I have been struggling to get the right birth control drug for 9 years.I tried anything with lot of Estrogen to less everything with less Estrogen and more Testosterone. I started to get headaches. I did not think much of it at first, but the headaches got worse with each year going by and the increased severely towards having headaches each day - whole day. My headaches effected my job, my concentration, my relationship, any outdoor activities, sport &amp; exercise. It got so bad, I used to wake up with them, go to be with them and drink pain killers just to get through the day. My doctor recommended the Mirena. I went ahead with the Mirena procedure. It changed my life. It has been 2 months since I had a headache.I am truly grateful!",
                "tweet_2": "I got my Mirena almost 6 months ago now and I absolutely love it. I read so many reviews that made me hesitate to get it - it took me months to decide which birth control to get, but my Dr recommended this so I trusted her. I have had 1 child previously, 2 years ago now, so I think that helped make my experience smooth. I took some ibuprofen before getting it put in and there was discomfort but nothing unbearable. I spotted and had irregular periods for the first 2 months, it was really annoying. Then I spotted occasionally for another two months or so. My periods have stopped completely now so it was worth it. Also, the cramping was not bad at all. Nothing more than the moderate period pains I used to get. And my partner never notices it."
            }
        },
        "topic_number_11": {
            "count": 15,
            "name": "11_Mirena insertion experiences and effects vs. Depo shot",
            "tweet": {
                "tweet_0": "I had the mirena inserted last Thursday 6/11/15. I took ibuprofen 1hr before. The cramp on insertion was not as bad as I thought it would be. Maybe the ibuprofen worked. The cramping has stopped but I still continue to spot. Other than spotting so far so good. Before mirena I was on the depo. I gained 20 lbs and what was suppose to help my bleeding only cause me more trouble. Depo caused me to have no period for 6 wks then I would spot the next 6 weeks until next injection. I really hope the mirena works out. Also with depo I had large clots. No clots so far since the mirena",
                "tweet_1": "I&#039;ve had my Mirena for about 9 months after having been on the Depo shot for 10 years. I chose this device because the Depo was too strong and my emotions flat-lined. I have a history of painful periods and need something so I can function. On the Mirena I have some annoying but manageable cramps and no bleeding. More importantly, I have mood fluctuations (a good thing) but nothing like the PMS extremes. Insertion was not very bad (I have not had children) as long as you take some pain killer a few hours before and get the cervical softener in place in the vagina the night before. I also had an experienced doctor insert it. Definitely do your research before you get it inserted. Overall, this is working very well. I have even lost a few pounds!",
                "tweet_2": "I got Mirena put in about a year ago. I was very happy with the depo shot, but because of the dr appts and the risk of bone density loss, I was recommended to get the Mirena. Prior to Mirena, I hadn&#039;t had a period in about 8 years (which I loved). The first 8 months or so after insertion were great. However, at month 9, I started a bleeding and had awful cramping which nothing helped (ibuprofen, heat packs, etc.).It was so bad and I was so unused to a period at that point (I was told I may have spotting the first 6mo after getting it put in, but that my period would most likely not restart),  that I made an appt with my gyno. Turns out, everything was fine. I just now have a very long, very painful period every month. I may go back to depo."
            }
        },
        "topic_number_12": {
            "count": 14,
            "name": "12_Mirena for Heavy Bleeding and Fibroids",
            "tweet": {
                "tweet_0": "I am 51 and still have excessive bleeding during my period. I had Mirena inserted on the second day of my period. Had period for three more days then I stopped for six days. Then I started my petiod back up bleeding continually and I&#039;m on my 28th day now. Insertion was a breeze I had given birth to two children vaginaly.  Only took Tylenol and had no cramping.  My Gyno wants me to give it at least four months before I make a decision.  Just hoping that menopause will come soon and this will be a mute point.  My face has not broken out I have not had Moodswings and have not noticed any weight gain.    After reading most of these reviews it is fair to say we are all reacting differently.  My bleeding is still not as heavy as it was before.",
                "tweet_1": "I&rsquo;m 48, never had children but have uterine fibroids which were removed and very quickly returned. Because of the heavy bleeding new doctor recommended Mirena to hopefully reduce the heavy bleeding. Thought this was a great idea! No more ultra tampons and overnight pads as a back up. No such luck. Got Mirena inserted 6/14/17 and have been bleeding ever since. Thought this could not be real. Doctor sent me for ultrasound to be sure Mirena was still in my uterus...yep it&rsquo;s there so I&rsquo;ll have to put up with the bleeding. I&lrm;t is UNREAL. I&rsquo;ve bleed for 5 months with maybe 2 weeks of no bleeding. This is awful, bleeding every day...day after day. The number of pads and tampons are becoming expensive. I&rsquo;m seriously at my wits end.",
                "tweet_2": "At 51, I have uterine fibroids and was experiencing super heavy bleeding for months at a time. My doctor recommended Mirena and I unenthusiastically agreed to it because my other choice was hysterectomy. When younger I had a terrible experience with the pill (made me really depressed which otherwise I am not). I had Mirena inserted 4 months ago and love it. I put on a bit of weight at the beginning which I have mostly lost already. The heavy bleeding is gone. I still wear a pad because I spot once in awhile but before I was using Depend because the bleeding was SO HEAVY. My mood is Ok. no depression or any similar symptoms. No acne. Insertion is painful but quick. The discomfort goes away immediately. So far Mirena is Ok for me."
            }
        },
        "topic_number_13": {
            "count": 11,
            "name": "13_Negative experiences with IUD insertion and removal causing various physical and mental health issues",
            "tweet": {
                "tweet_0": "I had almost a constant headache when I first had it in I gained 12 lbs in 2 weeks (thought it was water but it stayed). Not sure if I got depression or I just didn&#039;t feel right. Got it out yesterday..no more constant headache!",
                "tweet_1": "This was placed in April of 2014. I have had it removed a week ago due to very severe back pain. I also had anxiety, depression and severe headaches. I would rather have the bleeding. My headaches and back pain stopped once it was removed and suspect that the depression and anxiety will also improve now. My MD and OBGYN did not recommend removing it, but I insisted and am glad I did. They were convinced the back pain  &amp; headaches was due to something else.",
                "tweet_2": "Got it put in November 2014, removed January 2016. I had 12 yeast infections, 1 E coli infection. Boobs hurt a week or so before my period then a light menstrual flow, gained 15lbs in my gut only. Insane pain in my right ovary. I hated it. Had implanon before but after 5 mos of bleeding finally got it removed and IUD put in. Removed last week started heavy period right away. I hated it."
            }
        },
        "topic_number_14": {
            "count": 11,
            "name": "14_Experiences with Mirena Insertion and Side Effects",
            "tweet": {
                "tweet_0": "Had my Mirena inserted July 30 2014, I am giving it such a high rating at this point because I have nothing but positive experiences so far. \r\nUnlike most people I had it inserted after having no children, the insertion was slightly painful but just felt like a bad cramp that went away quickly. The cramping stopped 2 minutes after insertion and then I had some mild cramping later that day. Spotting is minimal to null, only noticeable on bathroom tissue. \r\n-For anyone thinking of getting on before they have had a kid: I was given misoprostol vaginally to soften the cervix and took ibuprofen for 24 hours before to help with cramping.  The misoprostol did not cause me cramping or discomfort as I feared it would.",
                "tweet_1": "I am 18 years old and do not have kids. I got Mirena inserted last week. The insertion itself was not that bad, just a bit of discomfort, it was like 3 pinches. When it was over, the doctor asked me how I was feeling, and I felt fine so he let me get up to get dressed. When I came back in the room, I almost passed out and thought I was going to throw up. The nurse got me lying down on the bed again and these feelings went away. The cramping started at this time. I cramped that day, which was manageable with 2 Midol%u2019s and 2 Advil (which was a great combination for this procedure). For the next few days I would get a cramp once a day, no big deal. I haven%u2019t been spotting at all, just a tiny bit right after the insertion.",
                "tweet_2": "I had my mirena inserted 7 weeks ago. My doc first tried inserting it in her office. After several painful tries including using dilitation tools, she gave up. I have 3 children and one was a home birth with no meds. I would rather give birth then do that again!!! It was nasty. I cramped and bled for many days after.\r\r\nI had it inserted several months later via surgery. I had less cramping and needed no pain meds after. A week later I started having painful cramping and 3 weeks of bleeding. The pain was so bad if I was in bed no one could touch it as it would start another cramp. \r\r\nLast week, I got up at 3 am to go to the bathroom. On the way back I was hit with the worst pain ever. I went to the er, and it left after 20 min."
            }
        },
        "topic_number_15": {
            "count": 10,
            "name": "15_Hair loss after Mirena insertion and effects on weight, periods, and overall well-being",
            "tweet": {
                "tweet_0": "I am 25, and I had the Mirena inserted 8 weeks after my second son was born. I was prepared for a painful experience, but as I sat there preparing myself for pain, I was relieved when the M.D. said okay done, and I had felt nothing. I bled heavily for about a month after insertion, and one small period the next month, but after this, no periods. I&#039;ve managed to lose my baby weight, back at 135lbs. Of course I&#039;m tired I have one son who is 2 1/2 and another is 10 months old. Any hair loss I had was coordinated with stopping breast feeding, and so far no cramping/migraines outside the normal. So overall I&#039;m completely happy with my choice of the Mirena.",
                "tweet_1": "I had mirena inserted Sept 23 2015. I have given birth full term 7 times, and the discomfort for me was definitely comparative! I wanted mirena so I could have sex without worrying about another pregnancy, but due to bleeding heavily for 3 out of every 4 weeks (to date it is now January 1, 2016) I have not even had sex because of the mess! I even have some spotting during the &quot;week off&quot;!!\r\nI always had regular periods with 7 days of heavy bleeding, I&#039;ll be happy to go back to that. I haven&#039;t gained weight from it, but I fluctuate about 5-8 lbs from week to week. My hair was already thinning, but that seems worse, the texture of my hair is more fragile.",
                "tweet_2": "I am 17 years old, mother of a five month old girl. I had Mirena inserted six weeks after she was born. Even since, I have been experiencing increasing hair loss, an increased appetite, daily fatigue, lower sex drive, mood swings, unexplainable sadness. Also I bled heavily for three months immediately after I got it with lots of cramping. After it stopped, I didn&#039;t bleed at all for 2 1/2 months until now and its very light, but heavy cramps. I sometimes felt like I was pregnant, despite negative tests. I gained 20 lbs and have headaches. "
            }
        },
        "topic_number_16": {
            "count": 10,
            "name": "16_Mirena birth control effectiveness and experiences",
            "tweet": {
                "tweet_0": "I had the Mirena inserted 4 months ago and I absolutely love it. I am 19, have never been pregnant, and was looking for the lowest maintenance birth control possible. The insertion was incredibly painful, honestly the worst pain that I have ever felt in my life, and I experienced cramping for the rest of the day. I had to lay in bed with a heat pack on my abdomen and try to ignore the pain. After that though, it has been everything a birth control should be. I haven&#039;t experienced any of the potential nasty side effects, and I think I actually have an increased sex drive. I don&#039;t get my period anymore, which my doctor said is normal. I would recommend this to any woman, because it has made my life much easier!",
                "tweet_1": "I am 39 years old, have never been pregnant and had my Mirena inserted a month ago. I got it hoping to get lighter periods and an increased sex drive. I had been taking birth control pills, which can negatively affect your sex drive.\r\n\r\nI took a Xanax and a Darvocet before the insertion and still found it quite painful with cramping for two days.  Then I had spotting and mild cramping for a week.  Now I have been bleeding almost as heavily as a normal period for about a week (longer than they used to last).\r\n\r\nI am very excited for this adjustment period to be over and to stop bleeding. As for side effects, my skin is actually clearer than before and I%u2019m always moody anyway.",
                "tweet_2": "Mirena has been a brilliant alternative to taking the pill for me. I had it inserted 4 months ago and have experienced no side effects or problems since. I love the fact that you don&#039;t even need to think about it. I am a 26 year old with no previous children, I say this as it is often recommended for people who have already had kids. I am married and I plan to stay on it for about three years. \r\n\r\nThe insertion process was a lot like having a Pap smear. It did not take very long however it was very painful (9/10) for about a minute. Afterwards I experienced a lot of cramping and discomfort for the rest of the day. I feel like although it was an unpleasant experience in the long term it is totally worth it. I never had major problems with the pill either however I did experience mood swings and a low libido. I also didn&#039;t like the fact that I had to remember to take it daily and I would often fail to take it at a consistent time.\r\n\r\nSince being on Mirena I have rarely gotten my period, (it has been nice not to think about tampons!) I did occasionally have some very light spotting in the first two months. I have been meaning to write this review for a while as I have been very pleased with my experience. I highly recommend it to others my age, it is a sensible, convenient option and I have been a much happier person ever since."
            }
        }
    }
}